contiki-ng/contiki-ng/arch/cpu/cc26x0-cc13x0/rf-core/prop-mode.c
  /* If we were off, turn back off */
  if(was_off) {
    off();
  }

  return rssi;
}
/*---------------------------------------------------------------------------*/
static uint8_t
get_channel(void)
{
  uint32_t freq_khz;

  freq_khz = settings_cmd_prop_fs.frequency * 1000;

  /*
   * For some channels, fractFreq * 1000 / 65536 will return 324.99xx.
   * Casting the result to uint32_t will truncate decimals resulting in the
   * function returning channel - 1 instead of channel. Thus, we do a quick
   * positive integer round up.
   */
  freq_khz += (((settings_cmd_prop_fs.fractFreq * 1000) + 0x10000) / 0x10000);

  return (freq_khz - DOT_15_4G_CHAN0_FREQUENCY) / DOT_15_4G_CHANNEL_SPACING;
}
/*---------------------------------------------------------------------------*/
static void
set_channel(uint8_t channel)
{
  uint32_t new_freq;
  uint16_t freq, frac;

  new_freq = dot_15_4g_freq(channel);

  freq = (uint16_t)(new_freq / 1000);
  frac = (new_freq - (freq * 1000)) * 0x10000 / 1000;

  PRINTF("set_channel: %u = 0x%04x.0x%04x (%lu)\n", channel, freq, frac,
         new_freq);

  settings_cmd_prop_radio_div_setup.centerFreq = freq;
  settings_cmd_prop_fs.frequency = freq;
  settings_cmd_prop_fs.fractFreq = frac;
}

/*---------------------------------------------------------------------------*/
/* Returns the current TX power in dBm */
static radio_value_t
get_tx_power(void)
{
  return tx_power_current->dbm;
}
/*---------------------------------------------------------------------------*/
enum {
    RADIO_RESULT_NOCHANGE = RADIO_RESULT_OK-1
};
/*
 * The caller must make sure to send a new CMD_PROP_RADIO_DIV_SETUP to the
 * radio after calling this function.
 */
static int
set_tx_power(radio_value_t power)
{
  const prop_mode_tx_power_config_t* x;
  x = rfc_tx_power_eval_power_code(power, TX_POWER_DRIVER);

  if (x == NULL)
      return RADIO_RESULT_NOCHANGE;

  if (x == tx_power_current)
      return RADIO_RESULT_NOCHANGE;

  tx_power_current = x;
  return RADIO_RESULT_OK;

}
/*---------------------------------------------------------------------------*/

#if DEBUG == 0
static
int rf_cmd_exec(rfc_radioOp_t *cmd)
{
    uint32_t cmd_status;
    /* Send Radio setup to RF Core */
    if(rf_core_send_cmd((uint32_t)cmd, &cmd_status) != RF_CORE_CMD_OK) {
      return RF_CORE_CMD_ERROR;
    }

  /* Wait until radio setup is done */
    if(rf_core_wait_cmd_done(cmd) != RF_CORE_CMD_OK) {
      return RF_CORE_CMD_ERROR;
    }

    return RF_CORE_CMD_OK;
}
#define rf_cmd_execute(cmd, name) rf_cmd_exec(cmd)

#else

static
int rf_cmd_execute(rfc_radioOp_t *cmd, const char* name )
{
    uint32_t cmd_status;
    /* Send Radio setup to RF Core */
    if(rf_core_send_cmd((uint32_t)cmd, &cmd_status) == RF_CORE_CMD_ERROR) {
      PRINTF("%s: CMDSTA=0x%08lx, status=0x%04x\n"
              ,name, cmd_status, cmd->status);
      return RF_CORE_CMD_ERROR;
    }

    /* Wait until radio setup is done */
    if(rf_core_wait_cmd_done(cmd) == RF_CORE_CMD_ERROR) {
      PRINTF("%s wait, CMDSTA=0x%08lx, status=0x%04x\n"
              ,name, cmd_status, cmd->status);
      return RF_CORE_CMD_ERROR;
    }
    return RF_CORE_CMD_OK;
}
#endif
/*---------------------------------------------------------------------------*/
static int
prop_div_radio_setup(void)
{
  rfc_radioOp_t *cmd = (rfc_radioOp_t *)&settings_cmd_prop_radio_div_setup;

  rf_switch_select_path(RF_SWITCH_PATH_SUBGHZ);

  /* Adjust loDivider depending on the selected band */
  settings_cmd_prop_radio_div_setup.loDivider = PROP_MODE_LO_DIVIDER;

  /* Update to the correct TX power setting */
  settings_cmd_prop_radio_div_setup.txPower = tx_power_current->tx_power;

  /* Adjust RF Front End and Bias based on the board */
  settings_cmd_prop_radio_div_setup.config.frontEndMode =
    RF_CORE_PROP_FRONT_END_MODE;
  settings_cmd_prop_radio_div_setup.config.biasMode =
    RF_CORE_PROP_BIAS_MODE;

  return rf_cmd_execute(cmd, "prop_div_radio_setup: DIV_SETUP");
}
/*---------------------------------------------------------------------------*/
static uint8_t
rf_cmd_prop_rx()
{
  uint32_t cmd_status;
  volatile rfc_CMD_PROP_RX_ADV_t *cmd_rx_adv;
  int ret;

  cmd_rx_adv = (rfc_CMD_PROP_RX_ADV_t *)&settings_cmd_prop_rx_adv;
  cmd_rx_adv->status = RF_CORE_RADIO_OP_STATUS_IDLE;

  cmd_rx_adv->rxConf.bIncludeCrc = RF_CORE_RX_BUF_INCLUDE_CRC;
  cmd_rx_adv->rxConf.bAppendRssi = RF_CORE_RX_BUF_INCLUDE_RSSI;
  cmd_rx_adv->rxConf.bAppendTimestamp = RF_CORE_RX_BUF_INCLUDE_TIMESTAMP;
  cmd_rx_adv->rxConf.bAppendStatus = RF_CORE_RX_BUF_INCLUDE_CORR;

  /*
   * Set the max Packet length. This is for the payload only, therefore
   * 2047 - length offset
   */
  cmd_rx_adv->maxPktLen = DOT_4G_MAX_FRAME_LEN - cmd_rx_adv->lenOffset;

  ret = rf_core_send_cmd((uint32_t)cmd_rx_adv, &cmd_status);

  if(ret != RF_CORE_CMD_OK) {
    PRINTF("rf_cmd_prop_rx: send_cmd ret=%d, CMDSTA=0x%08lx, status=0x%04x\n",
           ret, cmd_status, cmd_rx_adv->status);
    return ret;
  }

  RTIMER_BUSYWAIT_UNTIL( (cmd_rx_adv->status >= RF_CORE_RADIO_OP_STATUS_ACTIVE )
                       , RF_CORE_ENTER_RX_TIMEOUT);

  /* Wait to enter RX */
  if(cmd_rx_adv->status != RF_CORE_RADIO_OP_STATUS_ACTIVE) {
    PRINTF("rf_cmd_prop_rx: CMDSTA=0x%08lx, status=0x%04x\n",
           cmd_status, cmd_rx_adv->status);
    return RF_CORE_CMD_ERROR;
  }

  return ret;
}
/*---------------------------------------------------------------------------*/
static void
init_rx_buffers(void)
{
  rfc_dataEntry_t *entry;
  int i;

  for(i = 0; i < PROP_MODE_RX_BUF_CNT; i++) {
    entry = (rfc_dataEntry_t *)rx_buf[i];
    entry->status = DATA_ENTRY_STATUS_PENDING;
    entry->config.type = DATA_ENTRY_TYPE_GEN;
    entry->config.lenSz = DATA_ENTRY_LENSZ_WORD;
    entry->length = RX_BUF_SIZE - 8;
    entry->pNextEntry = rx_buf[i + 1];
  }

  ((rfc_dataEntry_t *)rx_buf[PROP_MODE_RX_BUF_CNT - 1])->pNextEntry = rx_buf[0];
}
/*---------------------------------------------------------------------------*/
static int
rx_on_prop(void)
{
  int ret;

