contiki-ng/contiki-ng/arch/cpu/cc26x0-cc13x0/rf-core/prop-mode.c
  /*
   * pktLen: Total number of bytes in the TX buffer, including the header if
   * one exists, but not including the CRC (which is not present in the buffer)
   */
  cmd_tx_adv->pktLen = transmit_len + DOT_4G_PHR_LEN;
  cmd_tx_adv->pPkt = tx_buf;

  /* Abort RX */
  rx_off_prop();

  /* Enable the LAST_COMMAND_DONE interrupt to wake us up */
  rf_core_cmd_done_en(false);

  ret = rf_core_send_cmd((uint32_t)cmd_tx_adv, &cmd_status);

  if(ret) {
    /* If we enter here, TX actually started */
    ENERGEST_SWITCH(ENERGEST_TYPE_LISTEN, ENERGEST_TYPE_TRANSMIT);

    /* Idle away while the command is running */
    while((cmd_tx_adv->status & RF_CORE_RADIO_OP_MASKED_STATUS)
          == RF_CORE_RADIO_OP_MASKED_STATUS_RUNNING) {
      /* Note: for now sleeping while Tx'ing in polling mode is disabled.
       * To enable it:
       *  1) make the `lpm_sleep()` call here unconditional;
       *  2) change the radio ISR priority to allow radio ISR to interrupt rtimer ISR.
       */
      if(!rf_core_poll_mode) {
        lpm_sleep();
      }
    }

    if(cmd_tx_adv->status == RF_CORE_RADIO_OP_STATUS_PROP_DONE_OK) {
      /* Sent OK */
      ret = RADIO_TX_OK;
    } else {
      /* Operation completed, but frame was not sent */
      PRINTF("transmit: Not Sent OK status=0x%04x\n",
             cmd_tx_adv->status);
      ret = RADIO_TX_ERR;
    }
  } else {
    /* Failure sending the CMD_PROP_TX command */
    PRINTF("transmit: PROP_TX_ERR ret=%d, CMDSTA=0x%08lx, status=0x%04x\n",
           ret, cmd_status, cmd_tx_adv->status);
    ret = RADIO_TX_ERR;
  }

  /*
   * Update ENERGEST state here, before a potential call to off(), which
   * will correctly update it if required.
   */
  ENERGEST_SWITCH(ENERGEST_TYPE_TRANSMIT, ENERGEST_TYPE_LISTEN);

  /*
   * Disable LAST_FG_COMMAND_DONE interrupt. We don't really care about it
   * except when we are transmitting
   */
  rf_core_cmd_done_dis();

  /* Workaround. Set status to IDLE */
  cmd_tx_adv->status = RF_CORE_RADIO_OP_STATUS_IDLE;

  rx_on_prop();

  if(was_off) {
    off();
  }

  return ret;
}
/*---------------------------------------------------------------------------*/
static int
send(const void *payload, unsigned short payload_len)
{
  prepare(payload, payload_len);
  return transmit(payload_len);
}
/*---------------------------------------------------------------------------*/
static void
release_data_entry(void)
{
  rfc_dataEntryGeneral_t *entry = (rfc_dataEntryGeneral_t *)rx_read_entry;
  uint8_t *data_ptr = &entry->data;
  int_master_status_t interrupt_status;

  /* Clear the length field (2 bytes) */
  data_ptr[0] = 0;
  data_ptr[1] = 0;

  /* Set status to 0 "Pending" in element */
  entry->status = DATA_ENTRY_STATUS_PENDING;
  rx_read_entry = entry->pNextEntry;

  interrupt_status = critical_enter();
  if(rf_core_rx_is_full) {
    rf_core_rx_is_full = false;
    PRINTF("RXQ was full, re-enabling radio!\n");
    rx_on_prop();
  }
  critical_exit(interrupt_status);

}
/*---------------------------------------------------------------------------*/
static int
read_frame(void *buf, unsigned short buf_len)
{
  rfc_dataEntryGeneral_t *entry = (rfc_dataEntryGeneral_t *)rx_read_entry;
  uint8_t *data_ptr;
  int len = 0;
  uint32_t rat_timestamp;

  int is_found = 0;
  /* Go through all RX buffers and check their status */
  do {
    if( entry->status >= DATA_ENTRY_STATUS_FINISHED
        || entry->status == DATA_ENTRY_STATUS_BUSY) {
      is_found = 1;
      break;
    }

    entry = (rfc_dataEntryGeneral_t *)entry->pNextEntry;
  } while(entry != (rfc_dataEntryGeneral_t *)rx_read_entry);

  if(is_found == 0) {
    /* No available data */
    return 0;
  }

  rx_read_entry = (volatile uint8_t *)entry;

  /* wait for entry to become finished */
  rtimer_clock_t t0 = RTIMER_NOW();
  while(entry->status == DATA_ENTRY_STATUS_BUSY
      && RTIMER_CLOCK_LT(RTIMER_NOW(), t0 + (RTIMER_SECOND / 50)));

#if MAC_CONF_WITH_TSCH
  /* Make sure the flag is reset */
  is_receiving_packet = 0;
#endif

  if(entry->status != DATA_ENTRY_STATUS_FINISHED) {
    /* No available data */
    return 0;
  }

  /*
   * First 2 bytes in the data entry are the length.
   * Our data entry consists of:
   *   Payload + RSSI (1 byte) + Timestamp (4 bytes) + Status (1 byte)
   * This length includes all of those.
   */
  data_ptr = &entry->data;
  len = (*(uint16_t *)data_ptr);

  if(len <= RX_BUF_METADATA_SIZE) {
    PRINTF("RF: too short!");

    release_data_entry();
    return 0;
  }

  data_ptr += 2;
  len -= RX_BUF_METADATA_SIZE;

  if(len > buf_len) {
    PRINTF("RF: too long\n");

    release_data_entry();
    return 0;
  }

  memcpy(buf, data_ptr, len);

  /* get the RSSI and status */
  rf_core_last_rssi = (int8_t)data_ptr[len];
  rf_core_last_corr_lqi = data_ptr[len + 5];

  /* get the timestamp */
  memcpy(&rat_timestamp, data_ptr + len + 1, 4);

  rf_core_last_packet_timestamp = rf_core_convert_rat_to_rtimer(rat_timestamp);

  if(!rf_core_poll_mode) {
    /* Not in poll mode: packetbuf should not be accessed in interrupt context.
     * In poll mode, the last packet RSSI and link quality can be obtained through
     * RADIO_PARAM_LAST_RSSI and RADIO_PARAM_LAST_LINK_QUALITY */
    packetbuf_set_attr(PACKETBUF_ATTR_RSSI, rf_core_last_rssi);
    packetbuf_set_attr(PACKETBUF_ATTR_LINK_QUALITY, rf_core_last_corr_lqi);
  }

  release_data_entry();

  return len;
}
/*---------------------------------------------------------------------------*/
static int
channel_clear(void)
{
  uint8_t was_off = 0;
  uint32_t cmd_status;
  int8_t rssi = RF_CORE_CMD_CCA_REQ_RSSI_UNKNOWN;

  /*
   * If we are in the middle of a BLE operation, we got called by ContikiMAC
   * from within an interrupt context. Indicate a clear channel
   */
  if(rf_ble_is_active() == RF_BLE_ACTIVE) {
    return RF_CORE_CCA_CLEAR;
  }

  if(!rf_core_is_accessible()) {
    was_off = 1;
    if(on() != RF_CORE_CMD_OK) {
      PRINTF("channel_clear: on() failed\n");
      if(was_off) {
        off();
      }
      return RF_CORE_CCA_CLEAR;
    }
  } else {
    if(transmitting()) {
      PRINTF("channel_clear: called while in TX\n");
      return RF_CORE_CCA_CLEAR;
    }
  }

